Revit 2027 API
FileOpenDialog Constructor
 Constructs a new instance of a File Open dialog.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FileOpenDialog(
	string filter
)
Public Sub New (
	filter As String
)
public:
FileOpenDialog(
	String^ filter
)
new :
        filter : string -> FileOpenDialog
Parameters
filter String
 The filter string. See the remarks for Filter for details.
Exceptions
Exception | Condition
ArgumentException |  The input filter string does not meet the minimal requirements for a valid filter string.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FileOpenDialog Class
Autodesk.Revit.UI Namespace